BasaDip/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридичесикйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьEMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Программы</name>
    <attributes>
      <name>Программа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BasaDip/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

BasaDip/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ЭтоЮрЛицо = Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо");
	ЭтоФизЛицо = Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо");
	
	Если ЭтоЮрЛицо И (НЕ ИННВерен(Объект.ИНН)) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, "Поле ИНН заполнено неверно!",,"Внимание! Ошибка!");
	КонецЕсли;
	
	Если ЭтоЮрЛицо И (НЕ ЗначениеЗаполнено(Объект.КПП) ИЛИ СтрДлина(Объект.КПП) <> 9) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, "Поле КПП заполнено неверно!",,"Внимание! Ошибка!");
	КонецЕсли;
	
	Если ЭтоФизЛицо И (НЕ ИННВерен(Объект.ИНН)) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, "Поле ИНН заполнено неверно!",,"Внимание! Ошибка!");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Элементы.КПП.Видимость = Ложь;
	КонецЕсли;
	
	АвтоматическоеПолноеНаименование = ПолучитьПолноеНаименование(ТекущийОбъект.Наименование);
	Если АвтоматическоеПолноеНаименование = ТекущийОбъект.ПолноеНаименование Тогда
		РучноеЗаполнение = Ложь;
	Иначе
		РучноеЗаполнение = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если Не РучноеЗаполнение Тогда
		Объект.ПолноеНаименование = ПолучитьПолноеНаименование(Объект.Наименование);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЮридическоеФизическоеЛицоПриИзменении(Элемент)
	Если Объект.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
		Элементы.КПП.Видимость = Ложь;
	Иначе
		Элементы.КПП.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	ТекстовоеОписаниеОшибки = "";
	Элементы.ИНН.ЦветФона = Новый Цвет;
	
	Если Не ИННВерен(Объект.ИНН) Тогда
		ТекстовоеОписаниеОшибки = "Ошибка! Поле ИНН заполнено неверно!";
		Элементы.ИНН.ЦветФона = WebЦвета.Розовый;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПрограммы
&НаКлиенте
Процедура ПрограммыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Программа", ВыбранноеЗначение);
	НайденныеСтроки = Объект.Программы.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтр = Объект.Программы.Добавить();
		НоваяСтр.Программа = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Программы);
	
КонецПроцедуры

&НаКлиенте
Процедура Событие(Команда)

ЗначениеОтбора = Новый Структура("Поставщик", Объект.Ссылка);
ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
ОткрытьФорму("Документ.Событие.ФормаСписка", ПараметрыФормы,, Объект.Ссылка); // Уникальность - Контрагент

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПолноеНаименование(Наименование)
	НаименованияОПФ = Новый Соответствие;
	НаименованияОПФ.Вставить("ООО", "Общество с ограниченной ответственностью");
	НаименованияОПФ.Вставить("ОАО", "Открытое акционерное общество");
	НаименованияОПФ.Вставить("ЗАО", "Закрытое акционерное общество");
	НаименованияОПФ.Вставить("ГУП", "Государственное унитарное предприятие");
	НаименованияОПФ.Вставить("ФКП", "Федеральное казенное предприятие");
	НаименованияОПФ.Вставить("АО", "Акционерное общество");
	НаименованияОПФ.Вставить("ИЧП", "Индивидуальное частное предприятие");
	НаименованияОПФ.Вставить("ИП", "Индивидуальный предприниматель");
	
	Для каждого НаименованиеОПФ Из НаименованияОПФ Цикл
		Если Лев(Наименование,СтрДлина(НаименованиеОПФ.Ключ)) = НаименованиеОПФ.Ключ Тогда
			ПерваяЧастьНаименования = НаименованиеОПФ.Значение;
			ВтораяЧастьНаименования = Сред(Наименование,(СтрДлина(НаименованиеОПФ.Ключ) +1));
			ПолноеНаименование = СтрШаблон("%1 %2", ПерваяЧастьНаименования, ВтораяЧастьНаименования);
		КонецЕсли;
	КонецЦикла;
	Возврат ПолноеНаименование;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИННВерен(ИНН)
	Если СтрДлина(ИНН) = 10 Тогда
		КЧ = ((2 * Сред(ИНН,1,1)) + (4 * Сред(ИНН,2,1)) + (10 * Сред(ИНН,3,1)) + 
		(3 * Сред(ИНН,4,1)) + (5 * Сред(ИНН,5,1)) + (9 * Сред(ИНН,6,1)) + (4 * Сред(ИНН,7,1)) + 
		(6 * Сред(ИНН,8,1)) + (8 * Сред(ИНН,9,1))) % 11;
		
		Если КЧ = Число(Сред(ИНН,10,1)) ИЛИ (КЧ = 10 И Сред(ИНН,10,1) = 0) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли СтрДлина(ИНН) = 12 Тогда
		КЧ1 = ((7 * Сред(ИНН,1,1)) +(2 * Сред(ИНН,2,1)) + (4 * Сред(ИНН,3,1)) + (10 * Сред(ИНН,4,1)) + 
		(3 * Сред(ИНН,5,1)) + (5 * Сред(ИНН,6,1)) + (9 * Сред(ИНН,7,1)) + (4 * Сред(ИНН,8,1)) + 
		(6 * Сред(ИНН,9,1)) + (8 * Сред(ИНН,10,1))) % 11;
		
		КЧ2 = ( (3 * Сред(ИНН,1,1)) +(7 * Сред(ИНН,2,1)) +(2 * Сред(ИНН,3,1)) + (4 * Сред(ИНН,4,1)) + (10 * Сред(ИНН,5,1)) + 
		(3 * Сред(ИНН,6,1)) + (5 * Сред(ИНН,7,1)) + (9 * Сред(ИНН,8,1)) + (4 * Сред(ИНН,9,1)) + 
		(6 * Сред(ИНН,10,1)) + (8 * Сред(ИНН,11,1))) % 11;
		
		Если (КЧ1 = Число(Сред(ИНН,11,1)) ИЛИ (КЧ1 = 10 И Сред(ИНН,11,1) = 0)) И
			(КЧ2 = Число(Сред(ИНН,12,1)) ИЛИ (КЧ1 = 10 И Сред(ИНН,12,1) = 0)) Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(ИНН) Тогда
		Возврат Истина;
	ИначеЕсли СтрДлина(ИНН) <> 10 И СтрДлина(ИНН) <> 12 Тогда
		Возврат Ложь;
	КонецЕсли;
КонецФункции

#КонецОбласти
